[
  {
    "id": "52930",
    "nombre": "Pate Chinois",
    "categoria": "Beef",
    "area": "Canadian",
    "ingredientes": [
      "4 cups Potatoes",
      "60ml Butter",
      "½ cup Milk",
      "450g Minced Beef",
      "1 finely chopped Onion",
      "500ml Creamed Corn",
      "to taste Paprika",
      "to taste Parsley",
      "Dash Salt",
      "Dash Pepper"
    ],
    "instrucciones": "In a large pot of salted water, cook the potatoes until they are very tender. Drain.\r\nWith a masher, coarsely crush the potatoes with at least 30 ml (2 tablespoons) of butter. With an electric mixer, purée with the milk. Season with salt and pepper. Set aside.\r\nWith the rack in the middle position, preheat the oven to 190 °C (375 °F).\r\nIn a large skillet, brown the onion in the remaining butter. Add the meat and cook until golden brown. Season with salt and pepper. Remove from the heat.\r\nLightly press the meat at the bottom of a 20-cm (8-inch) square baking dish. Cover with the corn and the mashed potatoes. Sprinkle with paprika and parsley.\r\nBake for about 30 minutes. Finish cooking under the broiler. Let cool for 10 minutes.",
    "imagen": "https://www.themealdb.com/images/media/meals/yyrrxr1511816289.jpg"
  },
  {
    "id": "53093",
    "nombre": "Syrian Spaghetti",
    "categoria": "Pasta",
    "area": "Syrian",
    "ingredientes": [
      "16 ounces Spaghetti",
      "8 ounces Tomato Sauce",
      "6 oz Tomato Puree",
      "1 teaspoon Cinnamon",
      "1/4 cup Vegetable Oil",
      "Dash Salt",
      "Dash Pepper"
    ],
    "instrucciones": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\r\n\r\nBring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain and stir in tomato sauce, tomato paste, cinnamon, oil, salt and pepper. Transfer to prepared dish.\r\n\r\nBake in preheated oven for 1 hour, or until top is crunchy.",
    "imagen": "https://www.themealdb.com/images/media/meals/5fu4ew1760524857.jpg"
  },
  {
    "id": "53183",
    "nombre": "Spanish meatballs with clams, chorizo & squid",
    "categoria": "Miscellaneous",
    "area": "Spanish",
    "ingredientes": [
      "25g Butter",
      "3 diced Shallots",
      "1 teaspoon Smoked Paprika",
      "2 cloves minced Garlic",
      "1 clove finely chopped Garlic",
      "2 tblsp Dry sherry",
      "50g Breadcrumbs",
      "300g Pork",
      "1 Egg Yolks",
      "50 ml Olive Oil",
      "300g Chorizo",
      "300g Squid",
      "100 ml White Wine",
      "300g Tomato",
      "400g Clams",
      "Handful Parsley",
      "Drizzle Extra Virgin Olive Oil"
    ],
    "instrucciones": "step 1\r\nMelt the butter in a heavy-based casserole, then soften the shallots for 5 mins. Add the paprika and crushed garlic and cook for 1 min until the paprika becomes fragrant. Splash in the sherry, then pour the whole lot into a bowl with the breadcrumbs. Season and cool.\r\n\r\nstep 2\r\nAdd the pork mince and the egg yolk to the bowl, then beat well. Shape into 18 small meatballs. Wipe the pan, put on a medium-high heat, then add the oil. Fry the meatballs for 5 mins, just to colour, then lift onto a plate, but keep the oil in the pan. Sizzle the chorizo with the sliced garlic. Add the squid and fry to give a little colour. Now tip in the white wine and bring to the boil, scraping the bottom. Stir in the pulped tomatoes, bring to the boil, then add the meatballs and the clams. Cover and cook for 5 mins until the clam shells open. Discard any that stay shut. Sprinkle with the chopped parsley, drizzle with the extra virgin oil, then serve with crusty bread.",
    "imagen": "https://www.themealdb.com/images/media/meals/2wt8721763334199.jpg"
  },
  {
    "id": "53169",
    "nombre": "Ajo blanco",
    "categoria": "Starter",
    "area": "Spanish",
    "ingredientes": [
      "150g White bread",
      "200g Almonds",
      "50 ml Extra Virgin Olive Oil",
      "1 Garlic Clove",
      "1 ½ tbsp Red Wine Vinegar"
    ],
    "instrucciones": "step 1\r\nTip the bread into a bowl and pour over 350ml water. Leave to soak for 10 mins.\r\n\r\nstep 2\r\nBlend the ingredients together with 350ml water and 1 tsp salt.\r\n\r\nstep 3\r\nLet the soup cool in the fridge for 1 hr or so, then serve with a drizzle of oil and some black pepper.",
    "imagen": "https://www.themealdb.com/images/media/meals/5jdtie1763289302.jpg"
  },
  {
    "id": "52970",
    "nombre": "Tunisian Orange Cake",
    "categoria": "Dessert",
    "area": "Tunisian",
    "ingredientes": [
      "1 large Orange",
      "300g Caster Sugar",
      "75 ml Olive Oil",
      "280g Flour",
      "1 tbs Baking Powder",
      "4 large Eggs",
      "2 tsp Vanilla Extract"
    ],
    "instrucciones": "Preheat oven to 190 C / Gas 5. Grease a 23cm round springform tin.\r\nCut off the hard bits from the top and bottom of the orange. Slice the orange and remove all seeds. Puree the orange with its peel in a food processor. Add one third of the sugar and the olive oil and continue to mix until well combined.\r\nSieve together flour and baking powder.\r\nBeat the eggs and the remaining sugar with an electric hand mixer for at least five minutes until very fluffy. Fold in half of the flour mixture, then the orange and the vanilla, then fold in the remaining flour. Mix well but not for too long.\r\nPour cake mixture into prepared tin and smooth out. Bake in preheated oven for 20 minutes. Reduce the oven temperature to 160 C / Gas 2 and bake again for 30 minutes Bake until the cake is golden brown and a skewer comes out clean. Cool on a wire cake rack.",
    "imagen": "https://www.themealdb.com/images/media/meals/y4jpgq1560459207.jpg"
  },
  {
    "id": "52811",
    "nombre": "Ribollita",
    "categoria": "Vegetarian",
    "area": "Italian",
    "ingredientes": [
      "5 tablespoons Olive Oil",
      "1 chopped Onion",
      "1 chopped Carrots",
      "1 stalk chopped Celery",
      "1 tablespoon minced Garlic",
      "2 cups Cannellini Beans",
      "1 Canned tomatoes",
      "4 cups Water",
      "1 fresh sprig Rosemary",
      "1 fresh sprig Thyme",
      "1 pound chopped Kale",
      "4 thick slices Wholegrain Bread",
      "1 thinly sliced Red Onions",
      "½ cup freshly grated Parmesan"
    ],
    "instrucciones": "Put 2 tablespoons of the oil in a large pot over medium heat. When it’s hot, add onion, carrot, celery and garlic; sprinkle with salt and pepper and cook, stirring occasionally, until vegetables are soft, 5 to 10 minutes.\r\nHeat the oven to 500 degrees. Drain the beans; if they’re canned, rinse them as well. Add them to the pot along with tomatoes and their juices and stock, rosemary and thyme. Bring to a boil, then reduce heat so the soup bubbles steadily; cover and cook, stirring once or twice to break up the tomatoes, until the flavors meld, 15 to 20 minutes.\r\nFish out and discard rosemary and thyme stems, if you like, and stir in kale. Taste and adjust seasoning. Lay bread slices on top of the stew so they cover the top and overlap as little as possible. Scatter red onion slices over the top, drizzle with the remaining 3 tablespoons oil and sprinkle with Parmesan.\r\nPut the pot in the oven and bake until the bread, onions and cheese are browned and crisp, 10 to 15 minutes. (If your pot fits under the broiler, you can also brown the top there.) Divide the soup and bread among 4 bowls and serve.",
    "imagen": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg"
  },
  {
    "id": "53205",
    "nombre": "Thai prawn curry",
    "categoria": "Seafood",
    "area": "Thai",
    "ingredientes": [
      "1 tbls Vegetable Oil",
      "1 chopped Onion",
      "1 tsp Ginger",
      "2 tsp Thai Red Curry Paste",
      "400g Tinned Tomatos",
      "50g Coconut Cream",
      "400g Raw Frozen Prawns",
      "Chopped Coriander"
    ],
    "instrucciones": "step 1\r\nHeat the oil in a medium saucepan. Tip in the onion and ginger, then cook for a few mins until softened. Stir in the curry paste, then cook for 1 min more. Pour over the chopped tomatoes and coconut cream. Bring to the boil, then leave to simmer for 5 mins, adding a little boiling water if the mixture gets too thick.\r\n\r\nstep 2\r\nTip in the prawns, then cook for 5-10 mins more, depending on how large they are. Serve alongside some plain rice and sprinkle with a little chopped coriander, if you like.",
    "imagen": "https://www.themealdb.com/images/media/meals/qqlwv91763501559.jpg"
  },
  {
    "id": "53320",
    "nombre": "Chocolate alfajores",
    "categoria": "Dessert",
    "area": "Uruguayan",
    "ingredientes": [
      "150g Butter",
      "70g Sugar",
      "1 Egg",
      "25g Honey",
      "175g All purpose flour",
      "80g Cornstarch",
      "30g Unsweetened Cocoa",
      "1 tsp Baking Powder",
      "1 tsp Baking Powder",
      "400g Dulce de leche",
      "500g Milk Chocolate",
      "100g Butter",
      "Zest of 1 Orange"
    ],
    "instrucciones": "For the cookies cream the butter with the sugar for a few minutes. Then add the egg and honey and mix well. Add flour, cornstarch, cocoa, baking soda and baking powder and mix until you get a dough. Wrap in plastic wrap and chill for at least half an hour or overnight.\r\n\r\n2\r\nLine two baking sheets with parchment paper, preheat oven to 200 degrees Celsius.\r\n\r\n3\r\nDivide dough into two parts, put one part back in the fridge before using. Roll out second part to about 2 millimeters and cut out round cookies with 5-6 centimeters in diameter. This can be done with a cookie cutter or glass. You should get 30 cookies in total or even more, I get about 40. Bake one baking sheet at the time for about 8-10min. Let cookies cool.\r\n\r\n4\r\nFor the filling look for two cookies of the same size and place about one teaspoon of dulce de leche onto the bottom one before sandwiching together.\r\n\r\n5\r\nChop semi-sweet chocolate and melt with butter and orange zest on low heat. Dunk each sandwich cookie into the chocolate and let cool off on parchment paper before serving.",
    "imagen": "https://www.themealdb.com/images/media/meals/k9o0xr1764373018.jpg"
  },
  {
    "id": "53327",
    "nombre": "Venezuelan Coconut Chicken",
    "categoria": "Chicken",
    "area": "Venezulan",
    "ingredientes": [
      "2 Chicken Breasts",
      "2 chopped Onion",
      "1 clove peeled crushed Garlic",
      "4 Bay Leaves",
      "Pinch Black Pepper",
      "Pinch Turmeric",
      "Pinch Cumin",
      "Pinch Salt",
      "1 tablespoon Sugar",
      "3 Tomato",
      "1 tablespoon Ginger Paste",
      "1/3 cup Olive Oil",
      "1 Can Coconut Milk",
      "1/2 cup Water"
    ],
    "instrucciones": "Cut the chicken up into bite size pieces. Peel and cut the onions, mince the garlic.\r\nAssemble the rest of the ingredients and you are ready to start cooking.\r\nMake the Dish\r\nHeat up a fry pan over medium heat. Add the oil and when hot, sauté the onion until translucent. Remove from pan and transfer to a blender or food processor.\r\nAdd tomatoes, garlic, turmeric, cumin, sugar, ginger paste, coconut milk, water and blend smooth.\r\nIn the same pan you cooked the onion, add the chicken and brown all sides. This should take about 3 minutes.\r\nAdd the blender ingredients and bay leaves to the pan, bring to a simmer and cook until the chicken is white inside and the liquid is creamy. (15 to 20 minutes)\r\nRemove the bay leaves and serve with white rice.",
    "imagen": "https://www.themealdb.com/images/media/meals/z2sw3o1764378271.jpg"
  },
  {
    "id": "53043",
    "nombre": "Fish fofos",
    "categoria": "Seafood",
    "area": "Portuguese",
    "ingredientes": [
      "600g Haddock",
      "300g Potatoes",
      "1 chopped Green Chilli",
      "3 tbs Coriander",
      "1 tsp Cumin Seeds",
      "1/2 tsp Pepper",
      "3 cloves Garlic",
      "2 pieces Ginger",
      "2 tbs Flour",
      "3 Eggs",
      "75g Breadcrumbs",
      "For frying Vegetable Oil"
    ],
    "instrucciones": "STEP 1\r\n\r\nPut the fish into a lidded pan and pour over enough water to cover. Bring to a simmer and gently poach for 10 minutes over a low heat with the lid on. Drain and flake the fish.\r\n\r\nSTEP 2\r\n\r\nPut the fish, potato, green chilli, coriander, cumin, black pepper, garlic and ginger in a large bowl. Season, add the rice flour, mix well and break in 1 egg. Stir the mixture and divide into 15, then form into small logs. Break the remaining eggs into a bowl and whisk lightly. Put the breadcrumbs into another bowl. Dip each fofo in the beaten egg followed by the breadcrumb mixture. Chill for 20 minutes.\r\n\r\nSTEP 3\r\n\r\nHeat 1cm of oil in a large frying pan over a medium heat. Fry the fofos in batches for 2 minutes on each side, turning gently to get an even golden brown colour all over. Drain on kitchen paper and repeat with the remaining fofos.\r\n\r\nSTEP 4\r\n\r\nFor the onion salad, mix together the onion, coriander and lemon juice with a pinch of salt. Serve with the fofos and mango chutney.",
    "imagen": "https://www.themealdb.com/images/media/meals/a15wsa1614349126.jpg"
  },
  {
    "id": "53082",
    "nombre": "Strawberries Romanoff",
    "categoria": "Dessert",
    "area": "Russian",
    "ingredientes": [
      "2 pint Strawberries",
      "4 tbs Sugar",
      "4 tbs Grand Marnier",
      "1 cup Cream",
      "1/4 cup Sour Cream"
    ],
    "instrucciones": "In a medium bowl, combine hulled and quartered strawberries, 4 Tbsp sugar and 4 Tbsp liqueur, stir to combine then cover and refrigerate at least 1 hour and up to 2 hours, stirring once or twice.\r\n\r\nTwo photos of cut strawberries in a bowl with one having sugar being added to the bowl Two photos of cut up strawberries for Strawberry Romanoff \r\n\r\nJust before serving, in a large mixing bowl, combine 1 cup cold heavy cream and 1/4 cup powdered sugar, and beat with an electric mixer until stiff peaks form. Using a spatula, fold in 1/4 cup sour cream just until well blended.\r\n\r\nTo serve, stir strawberries then divide between 6 serving glasses or bowls. You can spoon a little syrup over the berries if you like. You can also use this syrup to soak a cake. Spoon cream over strawberries, dividing evenly. You can also use an ice cream scoop with trigger release for a nice rounded puff of cream. Serve right away or chill and enjoy within 2 hours of assembly.\r\n\r\n",
    "imagen": "https://www.themealdb.com/images/media/meals/oe8rg51699014028.jpg"
  },
  {
    "id": "52841",
    "nombre": "Creamy Tomato Soup",
    "categoria": "Starter",
    "area": "British",
    "ingredientes": [
      "3 tbsp Olive Oil",
      "2 chopped Onions",
      "2 sticks Celery",
      "300g Carrots",
      "500g Potatoes",
      "4 Bay Leaf",
      "5 tblsp Tomato Puree",
      "2 tblsp Sugar",
      "2 tblsp White Vinegar",
      "1½ kg Chopped Tomatoes",
      "500g Passata",
      "3 Vegetable Stock Cube",
      "400ml Whole Milk"
    ],
    "instrucciones": "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.\r\nStir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r\nTo serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls.",
    "imagen": "https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg"
  },
  {
    "id": "52813",
    "nombre": "Kentucky Fried Chicken",
    "categoria": "Chicken",
    "area": "American",
    "ingredientes": [
      "1 whole Chicken",
      "2 quarts neutral frying Oil",
      "1 Egg White",
      "1 1/2 cups Flour",
      "1 tablespoon Brown Sugar",
      "1 tablespoon Salt",
      "1 tablespoon paprika",
      "2 teaspoons onion salt",
      "1 teaspoon chili powder",
      "1 teaspoon black pepper",
      "1/2 teaspoon celery salt",
      "1/2 teaspoon sage",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon allspice",
      "1/2 teaspoon oregano",
      "1/2 teaspoon basil",
      "1/2 teaspoon marjoram"
    ],
    "instrucciones": "Preheat fryer to 350°F. Thoroughly mix together all the spice mix ingredients.\r\nCombine spice mix with flour, brown sugar and salt.\r\nDip chicken pieces in egg white to lightly coat them, then transfer to flour mixture. Turn a few times and make sure the flour mix is really stuck to the chicken. Repeat with all the chicken pieces.\r\nLet chicken pieces rest for 5 minutes so crust has a chance to dry a bit.\r\nFry chicken in batches. Breasts and wings should take 12-14 minutes, and legs and thighs will need a few more minutes. Chicken pieces are done when a meat thermometer inserted into the thickest part reads 165°F.\r\nLet chicken drain on a few paper towels when it comes out of the fryer. Serve hot.",
    "imagen": "https://www.themealdb.com/images/media/meals/40r49m1763197022.jpg"
  },
  {
    "id": "52987",
    "nombre": "Lasagna Sandwiches",
    "categoria": "Pasta",
    "area": "American",
    "ingredientes": [
      "1/4 cup Sour Cream",
      "2 tbs Chopped Onion",
      "1/2 tbs Dried Oregano",
      "1/4 tsp Salt",
      "8 slices Bread",
      "8 slices Bacon",
      "8 slices Tomato",
      "4 slices Mozzarella",
      "2 1/2 Tbs Butter"
    ],
    "instrucciones": "1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.\r\n\r\n2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.\r\n\r\nNutrition Facts\r\n1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein.",
    "imagen": "https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg"
  },
  {
    "id": "52939",
    "nombre": "Callaloo Jamaican Style",
    "categoria": "Miscellaneous",
    "area": "Jamaican",
    "ingredientes": [
      "1  bunch Kale",
      "2 strips Bacon",
      "3 cloves Chopped Garlic",
      "1 medium Onion",
      "1/2 tsp Paprika",
      "1 Sprig Thyme",
      "1 Tomato",
      "1 Red Pepper",
      "4 Banana",
      "Splash Vegetable Oil"
    ],
    "instrucciones": "Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r\nProceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r\nRemove kale from water cut in chunks.\r\nPlace bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r\nAdd tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r\nFinally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r\nUsing a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r\nSlice the plantain into medium size lengthwise slices and set aside.\r\nCoat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r\nLet the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r\nAs the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r\nRemove and serve with kale",
    "imagen": "https://www.themealdb.com/images/media/meals/ussyxw1515364536.jpg"
  },
  {
    "id": "53173",
    "nombre": "Quick gazpacho",
    "categoria": "Starter",
    "area": "Spanish",
    "ingredientes": [
      "250g Passata",
      "1 chopped Red Pepper",
      "1 chopped Red Chilli",
      "1 clove peeled crushed Garlic",
      "1 teaspoon Sherry vinegar",
      "Juice of 1/2 Lime"
    ],
    "instrucciones": "step 1\r\nIn a blender (or with a stick blender), whizz together the passata, red pepper, chilli, garlic, sherry vinegar and lime juice until smooth. Season to taste, then serve with ice cubes",
    "imagen": "https://www.themealdb.com/images/media/meals/h5qmn31763304965.jpg"
  },
  {
    "id": "52932",
    "nombre": "Pouding chomeur",
    "categoria": "Dessert",
    "area": "Canadian",
    "ingredientes": [
      "½ cup Butter",
      "1 cup Sugar",
      "2 Eggs",
      "1 tsp Vanilla Extract",
      "2 cups Flour",
      "1 tsp Baking Powder",
      "1 1/4 cup Milk",
      "1 1/2 cup Maple Syrup",
      "1 1/2 cup Brown Sugar",
      "1 1/2 cup Single Cream",
      "1/3 cup Butter"
    ],
    "instrucciones": "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light.\r\nAdd eggs and vanilla and mix.\r\nIn another bowl, mix flour and baking powder.\r\nAlternate flour mix and milk to the butter mix.\r\nPour into a 13 inch by 9 inch greased pan.\r\nMAPLE SAUCE.\r\nIn a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir.\r\nReduce heat and and gently cook 2 minutes or till sauce has reduced a little bit.\r\nPour sauce gently over cake.\r\nBake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean.",
    "imagen": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg"
  },
  {
    "id": "53346",
    "nombre": "Grape Nut Ice Cream",
    "categoria": "Dessert",
    "area": "Jamaican",
    "ingredientes": [
      "2 cups Heavy Cream",
      "1 1/4 oz Condensed Milk",
      "1 tsp Vanilla Extract",
      "1 cup Grape Nut Cereal"
    ],
    "instrucciones": "In a large bowl, use an electric mixer to whip the cold heavy cream until stiff peaks form. Gently fold in the sweetened condensed milk and vanilla extract until well combined.\r\nFold in the cereal and stir until evenly distributed throughout the mixture.\r\nPour the mixture into a freezer-safe container (such as a loaf pan). Lay plastic wrap on top of the ice cream to avoid freezer burn. Cover the container and freeze for at least 6 hours or until solid.\r\nOnce frozen, let the ice cream sit at room temperature for a few minutes to soften slightly before scooping and serving.",
    "imagen": "https://www.themealdb.com/images/media/meals/1xscby1764790242.jpg"
  },
  {
    "id": "53147",
    "nombre": "Arroz con gambas y calamar",
    "categoria": "Seafood",
    "area": "Spanish",
    "ingredientes": [
      "24 Raw King Prawns",
      "2 tbsp Olive Oil",
      "1 small Onion",
      "1 Bay Leaf",
      "1 pinch Saffron",
      "450g Paella Rice",
      "2 teaspoons Tomato Puree",
      "200ml White Wine",
      "650ml Seafood stock",
      "3 Medium Squid"
    ],
    "instrucciones": "step 1\r\nPeel and devein most of the prawns (a fishmonger should be able to do this for you), keeping a few whole for decoration, if you like. Heat the olive oil in a large frying pan or shallow flameproof casserole over a medium-low heat and fry the onion for 5 mins until softened. Add the bay leaf, saffron, rice and tomato purée, and cook for 1-2 mins more, stirring.\r\n\r\nstep 2\r\nPour in the wine and bubble for 1-2 mins, then pour in the seafood stock and 150ml water. Cook for 5 mins, then add the squid, season well and stir to combine. Bring to the boil, then cover and reduce the heat to a gentle simmer. Cook for 12 mins more, adding a little more water if the mixture starts to look dry.\r\n\r\nstep 3\r\nUncover the pan and stir through the peeled prawns, then arrange any whole prawns on top of the rice mixture. Cover again and simmer for a further 5-6 mins until the prawns are pink and cooked through. Leave to stand for a couple of minutes before serving from the pan.",
    "imagen": "https://www.themealdb.com/images/media/meals/jc6oub1763196663.jpg"
  },
  {
    "id": "53310",
    "nombre": "Challah",
    "categoria": "Side",
    "area": "Polish",
    "ingredientes": [
      "500g Strong white bread flour",
      "70g Caster Sugar",
      "10g Yeast",
      "2 Beaten Egg",
      "70 ml Sunflower Oil",
      "1 tablespoon Poppy Seeds"
    ],
    "instrucciones": "step 1\r\nCombine the yeast, a pinch of the sugar and a couple tablespoons of lukewarm water in a small bowl. Stir to dissolve the yeast, then leave for 10 mins until foamy.\r\n\r\nstep 2\r\nMeanwhile, combine the flour, the remaining sugar and 2 tsp fine salt in a large bowl. Make a well in the centre, then add half the beaten egg, the yeast mixture and the oil. Pour in 200ml lukewarm water (it should feel slightly warm to the touch) and stir with a spoon, then mix using one hand, keeping the other clean while you bring the dough together. If there are a lot of very dry bits, gradually add a little water to just bring it together – you don't want it to get too wet and sticky. The dough should be moist, but not soggy.\r\n\r\nstep 3\r\nOnce the dough has come together, turn it out onto a lightly floured surface. Knead using both hands for 10 mins until smooth and a bit springy. If it gets very sticky, add a very small amount of flour – as little as possible. A dough scraper is useful if the dough is sticking to the work surface. Stretch the sides of the dough down and pull together to form a ball. Lightly oil a bowl, then lightly roll the dough ball around the bowl so it's coated in the oil. Cover with a clean tea towel and leave in a warm place for 1 hr, or until dough has doubled in size.\r\n\r\nstep 4\r\nLine a baking sheet with baking parchment. Turn the dough out onto a clean work surface and divide into three equal pieces, weighing for accuracy, if you like. Roll each piece into a long sausage shape about 25cm long, tapering them slightly at both ends. Lay the pieces out in front of you, parallel to one another with a couple centimetres between each. Bring the sausages together at the top end, then plait them down the length, tucking in the ends when you reach the bottom. Carefully transfer the loaf to the prepared baking sheet and loosely cover with a clean tea towel. Leave to rise until puffy and billowy, about 40 mins.\r\n\r\nstep 5\r\nMeanwhile, heat the oven to 200C/180C fan/gas 6. Gently brush the rest of the beaten egg all over the challah, getting it into all the crevices, and sprinkle with the poppy or sesame seeds, if using. Bake on a middle shelf of the oven for 25-30 mins, until the loaf is golden brown underneath and sounds hollow when tapped. Check after about 15 mins – if the top of the loaf has started to get too dark, cover it with foil. Leave to cool on a wire rack, then serve.",
    "imagen": "https://www.themealdb.com/images/media/meals/fm01ky1764366365.jpg"
  },
  {
    "id": "53099",
    "nombre": "Aussie Burgers",
    "categoria": "Beef",
    "area": "Australian",
    "ingredientes": [
      "500g Lean Minced Steak",
      "100g Cooked Beetroot",
      "2 small Naan Bread",
      "50g Rocket",
      "4 tablespoons Soured cream and chive dip"
    ],
    "instrucciones": "step 1\r\nMake the burgers: Tip the meat into a bowl and sprinkle over 1 tsp salt and a good grinding of black pepper.Work with wet hands to mix in the seasoning. Divide into four with your hands and shape into burgers. (It can be frozen at this stage.)\r\n\r\nstep 2\r\nSort out your ingredients: Slice the beetroot and split the naan breads.\r\n\r\nstep 3\r\nToast the naans: Heat a griddle pan or barbecue. Griddle the naans on both sides until lightly toasted and set aside. Add the burgers to the grill or barbecue and cook for 2-3 minutes, then turn and cook the other side for a further 2-3 minutes.\r\n\r\nstep 4\r\nAssemble the dish: Set half a toasted naan on each serving plate and put a pile of rocket on each. Top with a burger, then a few slices of beetroot and a dollop of soured cream. Sprinkle with salt and freshly ground black pepper and serve immediately with a big green salad and chips. A glass of red wine wouldn’t go amiss, either.",
    "imagen": "https://www.themealdb.com/images/media/meals/44bzep1761848278.jpg"
  },
  {
    "id": "52816",
    "nombre": "Roasted Eggplant With Tahini, Pine Nuts, and Lentils",
    "categoria": "Vegetarian",
    "area": "American",
    "ingredientes": [
      "2 tablespoons Olive Oil",
      "2 small cut into chunks Carrots",
      "2 small stalks Celery",
      "1 medium finely diced Onion",
      "6 medium cloves sliced Garlic",
      "12 ounces (340g) Brown Lentils",
      "2 Bay Leaves",
      "4 cups Water",
      "Pinch Salt",
      "2 teaspoons (10ml) Apple Cider Vinegar",
      "Pinch Pepper",
      "2 large Egg Plants",
      "4 sprigs Rosemary",
      "1/4 cup Pine nuts",
      "2 tablespoons Parsley"
    ],
    "instrucciones": "\r\nFor the Lentils: Adjust oven rack to center position and preheat oven to 450°F to prepare for roasting eggplant. Meanwhile, heat 2 tablespoons olive oil in a medium saucepan over medium heat until shimmering. Add carrots, celery, and onion and cook, stirring, until softened but not browned, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add lentils, bay leaves, stock or water, and a pinch of salt. Bring to a simmer, cover with the lid partially ajar, and cook until lentils are tender, about 30 minutes. (Top up with water if lentils are at any point not fully submerged.) Remove lid, stir in vinegar, and reduce until lentils are moist but not soupy. Season to taste with salt and pepper, cover, and keep warm until ready to serve.\r\n\r\n2.\r\nFor the Eggplant: While lentils cook, cut each eggplant in half. Score flesh with the tip of a paring knife in a cross-hatch pattern at 1-inch intervals. Transfer to a foil-lined rimmed baking sheet, cut side up, and brush each eggplant half with 1 tablespoon oil, letting each brushstroke be fully absorbed before brushing with more. Season with salt and pepper. Place a rosemary sprig on top of each one. Transfer to oven and roast until completely tender and well charred, 25 to 35 minutes. Remove from oven and discard rosemary.\r\n\r\n3.\r\nTo Serve: Heat 2 tablespoons olive oil and pine nuts in a medium skillet set over medium heat. Cook, tossing nuts frequently, until golden brown and aromatic, about 4 minutes. Transfer to a bowl to halt cooking. Stir half of parsley and rosemary into lentils and transfer to a serving platter. Arrange eggplant halves on top. Spread a few tablespoons of tahini sauce over each eggplant half and sprinkle with pine nuts. Sprinkle with remaining parsley and rosemary, drizzle with additional olive oil, and serve.",
    "imagen": "https://www.themealdb.com/images/media/meals/ysqrus1487425681.jpg"
  },
  {
    "id": "53215",
    "nombre": "Shakshouka",
    "categoria": "Miscellaneous",
    "area": "Saudi Arabian",
    "ingredientes": [
      "250g Tomato",
      "40 ml Extra Virgin Olive Oil",
      "4 Egg",
      "4 sliced Garlic Clove",
      "To taste Black Pepper",
      "To taste Salt"
    ],
    "instrucciones": "1\r\nFirst, pan fry the black pepper and garlic over a dry medium heat until fragrant.\r\n2\r\nAdd a good amount of extra virgin olive oil and infuse for a minute.\r\n3\r\nOnce the oil heats up, add the tomatoes and salt, and cover with a lid. Simmer for 5 minutes.\r\n4\r\nRemove the lid and mash the tomatoes. Reduce until you reach the desired consistency of choice.\r\n5\r\nMake craters for the eggs and lower the heat. Carefully crack the eggs into the craters, making sure it touches the pan and not the tomato sauce.\r\n6\r\nCover the eggs and leave it for 5 minutes without lifting the lid.\r\n7\r\nRemove from the heat and let the residual heat steam the eggs for 1-2 minutes.\r\n8\r\nServe with flatbread. Enjoy!",
    "imagen": "https://www.themealdb.com/images/media/meals/crd1jz1763592990.jpg"
  },
  {
    "id": "52822",
    "nombre": "Toad In The Hole",
    "categoria": "Pork",
    "area": "British",
    "ingredientes": [
      "8 sausages",
      "3 tbsp vegetable oil",
      "100g plain flour",
      "2 medium eggs",
      "1 tbsp grated horseradish",
      "225ml milk",
      "200g cherry tomatoes"
    ],
    "instrucciones": "Preheat the oven to 200°C/fan180°C/gas 6. fry sausages in a non-stick pan until browned.\r\nDrizzle vegetable oil in a 30cm x 25cm x 6cm deep roasting tray and heat in the oven for 5 minutes.\r\nPut the plain flour in a bowl, crack in the medium free-range eggs, then stir in the grated horseradish. Gradually beat in the semi-skimmed milk. Season.\r\nPut the sausages into the hot roasting tray and pour over the batter. Top with cherry tomatoes on the vine and cook for 30 minutes until puffed and golden.",
    "imagen": "https://www.themealdb.com/images/media/meals/ytuvwr1503070420.jpg"
  },
  {
    "id": "53051",
    "nombre": "Nasi lemak",
    "categoria": "Seafood",
    "area": "Malaysian",
    "ingredientes": [
      "2 cups Coconut Milk",
      "2 cups Water",
      "1/4 tsp Ginger Paste",
      "1 Ginger",
      "1 Bay Leaf",
      "2 cups Rice",
      "4 Eggs",
      "1 Cucumber",
      "1 cup Peanuts",
      "4 oz Anchovy Fillet",
      "2 tbs Vegetable Oil",
      "1 Onion",
      "3 cloves Garlic",
      "3 Shallots",
      "2 tsp Chilli Powder",
      "4 oz Anchovy Fillet",
      "3 tbs Sugar",
      "1/3 cup Tamarind Paste"
    ],
    "instrucciones": "In a medium saucepan over medium heat, stir together coconut milk, water, ground ginger, ginger root, salt, bay leaf, and rice. Cover, and bring to a boil. Reduce heat, and simmer for 20 to 30 minutes, or until done.\r\n\r\n Step 2\r\nPlace eggs in a saucepan, and cover with cold water. Bring water to a boil, and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove eggs from hot water, cool, peel and slice in half. Slice cucumber.\r\n\r\n Step 3\r\nMeanwhile, in a large skillet or wok, heat 1 cup vegetable oil over medium-high heat. Stir in peanuts and cook briefly, until lightly browned. Remove peanuts with a slotted spoon and place on paper towels to soak up excess grease. Return skillet to stove. Stir in the contents of one package anchovies; cook briefly, turning, until crisp. Remove with a slotted spoon and place on paper towels. Discard oil. Wipe out skillet.\r\n\r\n Step 4\r\nHeat 2 tablespoons oil in the skillet. Stir in the onion, garlic, and shallots; cook until fragrant, about 1 or 2 minutes. Mix in the chile paste, and cook for 10 minutes, stirring occasionally. If the chile paste is too dry, add a small amount of water. Stir in remaining anchovies; cook for 5 minutes. Stir in salt, sugar, and tamarind juice; simmer until sauce is thick, about 5 minutes.\r\n\r\n Step 5\r\nServe the onion and garlic sauce over the warm rice, and top with peanuts, fried anchovies, cucumbers, and eggs.",
    "imagen": "https://www.themealdb.com/images/media/meals/wai9bw1619788844.jpg"
  },
  {
    "id": "52795",
    "nombre": "Chicken Handi",
    "categoria": "Chicken",
    "area": "Indian",
    "ingredientes": [
      "1.2 kg Chicken",
      "5 thinly sliced Onion",
      "2 finely chopped Tomatoes",
      "8 cloves chopped Garlic",
      "1 tbsp Ginger paste",
      "¼ cup Vegetable oil",
      "2 tsp Cumin seeds",
      "3 tsp Coriander seeds",
      "1 tsp Turmeric powder",
      "1 tsp Chilli powder",
      "2 Green chilli",
      "1 cup Yogurt",
      "¾ cup Cream",
      "3 tsp Dried fenugreek",
      "1 tsp Garam masala",
      "To taste Salt"
    ],
    "instrucciones": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
    "imagen": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg"
  },
  {
    "id": "52770",
    "nombre": "Spaghetti Bolognese",
    "categoria": "Beef",
    "area": "Italian",
    "ingredientes": [
      "2 onions",
      "1tbsp olive oil",
      "1 clove garlic",
      "500g lean minced beef",
      "90g mushrooms",
      "1tsp dried oregano",
      "400g can tomatoes",
      "300ml hot beef stock",
      "1tbsp tomato puree",
      "1tbsp worcestershire sauce",
      "350g spaghetti",
      "Topping parmesan"
    ],
    "instrucciones": "Put the onion and oil in a large pan and fry over a fairly high heat for 3-4 mins. Add the garlic and mince and fry until they both brown. Add the mushrooms and herbs, and cook for another couple of mins.\r\n\r\nStir in the tomatoes, beef stock, tomato ketchup or purée, Worcestershire sauce and seasoning. Bring to the boil, then reduce the heat, cover and simmer, stirring occasionally, for 30 mins.\r\n\r\nMeanwhile, cook the spaghetti in a large pan of boiling, salted water, according to packet instructions. Drain well, run hot water through it, put it back in the pan and add a dash of olive oil, if you like, then stir in the meat sauce. Serve in hot bowls and hand round Parmesan cheese, for sprinkling on top.",
    "imagen": "https://www.themealdb.com/images/media/meals/sutysw1468247559.jpg"
  },
  {
    "id": "53207",
    "nombre": "Tom kha gai",
    "categoria": "Chicken",
    "area": "Thai",
    "ingredientes": [
      "800ml Chicken Stock",
      "800g Coconut Milk",
      "2 tablespoons Galangal Paste",
      "2 Lemongrass Stalks",
      "8 Lime Leaves",
      "500g Chicken Thighs",
      "300g Oyster Mushrooms",
      "6 Birds-eye Chillies",
      "1 tablespoon Caster Sugar",
      "5 tablespoons Fish Sauce",
      "Juice of 3 Lime",
      "To serve Coriander Leaves",
      "To serve Rice"
    ],
    "instrucciones": "step 1\r\nPour the chicken stock and coconut milk into a large saucepan set over a medium heat. Tip in the galangal, lemongrass and lime leaves, and bring to a gentle simmer, around 6-8 mins. Keeping at a gentle simmer, add the chicken. Cook for 8-10 mins until tender and cooked through.\r\n\r\nstep 2\r\nStir in the mushrooms and chillies, and simmer for a further 3-5 mins until everything is cooked through. Sprinkle in the sugar and 3 tbsp each of the fish sauce and lime juice. Taste and add the remaining if required.\r\n\r\nstep 3\r\nRemove the galangal, lemongrass and lime leaves before serving using a slotted spoon. Ladle into bowls and serve with coriander leaves sprinkled over and steamed rice on the side. Will keep chilled for up to three days. Leave to cool first.",
    "imagen": "https://www.themealdb.com/images/media/meals/ol2xxt1763582263.jpg"
  },
  {
    "id": "52892",
    "nombre": "Treacle Tart",
    "categoria": "Dessert",
    "area": "British",
    "ingredientes": [
      "250g Plain Flour",
      "135g Butter",
      "400g Golden Syrup",
      "150g Breadcrumbs",
      "Zest of 2 Lemons",
      "1 beaten Eggs"
    ],
    "instrucciones": "First make the short crust pastry: measure the flour into a large bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs (alternatively, this can be done in a food processor). Add about three tablespoons of cold water and mix to a firm dough, wrap in cling film and chill in the fridge for about 20 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 and put a heavy baking tray in the oven to heat up. Grease a deep 18cm/7in loose-bottomed fluted flan tin with butter.\r\nRemove about 150g/5½oz of pastry from the main ball and set aside for the lattice top.\r\nRoll the rest of the pastry out thinly on a lightly floured work surface and line the prepared flan tin with the pastry.\r\nPrick the base with a fork, to stop the base rising up during baking.\r\nPlace the reserved pastry for the lattice top on cling film and roll out thinly. Egg wash the pastry and set aside to chill in the fridge (the cling film makes it easier to move about). Do not cut into strips at this stage. Do not egg wash the strips once they are on the tart as it will drip into the treacle mixture.\r\nTo make the filling, heat the syrup gently in a large pan but do not boil.\r\nOnce melted, add the breadcrumbs, lemon juice and zest to the syrup. (You can add less lemon if you would prefer less citrus taste.) If the mixture looks runny, add a few more breadcrumbs.\r\nPour the syrup mixture into the lined tin and level the surface.\r\nRemove the reserved pastry from the fridge and cut into long strips, 1cm/½in wide. Make sure they are all longer than the edges of the tart tin.\r\nEgg wash the edge of the pastry in the tin, and start to make the woven laying lattice pattern over the mixture, leave the strips hanging over the edge of the tin.\r\nOnce the lattice is in place, use the tin edge to cut off the strips by pressing down with your hands, creating a neat finish.\r\nBake on the pre-heated baking tray in the hot oven for about 10 minutes until the pastry has started to colour, and then reduce the oven temperature to 180C/350F/Gas 4. If at this stage the lattice seems to be getting too dark brown, cover the tart with tin foil.\r\nBake for a further 25-30 minutes until the pastry is golden-brown and the filling set.\r\nRemove the tart from the oven and leave to firm up in the tin. Serve warm or cold.",
    "imagen": "https://www.themealdb.com/images/media/meals/wprvrw1511641295.jpg"
  },
  {
    "id": "52926",
    "nombre": "Tourtiere",
    "categoria": "Pork",
    "area": "Canadian",
    "ingredientes": [
      "1 medium Potatoes",
      "1 tsp Sunflower Oil",
      "500g Minced Pork",
      "1 finely chopped Onion",
      "1 finely chopped Garlic Clove",
      "¼ tsp Cinnamon",
      "¼ tsp Allspice",
      "¼ tsp Nutmeg",
      "100ml Vegetable Stock",
      "400g Shortcrust Pastry",
      "To Glaze Egg"
    ],
    "instrucciones": "Heat oven to 200C/180C fan/gas 6. Boil the potato until tender, drain and mash, then leave to cool. Heat the oil in a non-stick pan, add the mince and onion and quickly fry until browned. Add the garlic, spices, stock, plenty of pepper and a little salt and mix well. Remove from the heat, stir into the potato and leave to cool.\r\nRoll out half the pastry and line the base of a 20-23cm pie plate or flan tin. Fill with the pork mixture and brush the edges of the pastry with water. Roll out the remaining dough and cover the pie. Press the edges of the pastry to seal, trimming off the excess. Prick the top of the pastry case to allow steam to escape and glaze the top with the beaten egg.\r\nBake for 30 mins until the pastry is crisp and golden. Serve cut into wedges with a crisp green salad. Leftovers are good cold for lunch the next day, served with a selection of pickles.",
    "imagen": "https://www.themealdb.com/images/media/meals/ytpstt1511814614.jpg"
  },
  {
    "id": "52769",
    "nombre": "Kapsalon",
    "categoria": "Lamb",
    "area": "Dutch",
    "ingredientes": [
      "250 Grams Fries",
      "500 Grams Doner Meat",
      "Topping Garlic sauce",
      "Topping Hotsauce",
      "1 Bulb Lettuce",
      "1 Tomato",
      "3rd Cucumber",
      "100 Grams Gouda cheese"
    ],
    "instrucciones": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
    "imagen": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg"
  },
  {
    "id": "53119",
    "nombre": "Tall Skoleboller",
    "categoria": "Dessert",
    "area": "Norwegian",
    "ingredientes": [
      "1 cup Milk",
      "3 tsp Instant Yeast",
      "1-⅓ cups Granulated Sugar",
      "1 tsp Cardamom",
      "1 teaspoon Vanilla Extract",
      "2 1/4 cups Flour",
      "5 tblsp Butter",
      "1 1/4 cup Milk",
      "1-⅓ cups Granulated Sugar",
      "3 Egg Yolks",
      "2 tblsp Cornstarch",
      "1 vanilla pod",
      "2 cups Powdered Sugar",
      "3  tablespoons Water",
      "1 cup Shredded Coconut"
    ],
    "instrucciones": "▢\r\nHeat the milk until it's lukewarm. Add the yeast and dissolve.\r\n▢\r\nAdd the sugar, cardamom, vanilla, and about 2/3 of the flour.\r\n▢\r\nMix the dough together either by hand or in a mixer with a dough hook, slowly adding the rest of the flour. You might need a bit more or less flour to form dough that isn't too sticky to knead. When the dough forms a nice ball, add the softened butter and continue to knead the dough for about ten minutes.\r\n▢\r\nRoll the dough into a cylinder and cut into six equal parts. Roll each piece into a round bun and set them in a greased muffin/cake tin. Cover and let rise until doubled in size (about an hour).",
    "imagen": "https://www.themealdb.com/images/media/meals/xihiu41762773169.jpg"
  },
  {
    "id": "52856",
    "nombre": "Choc Chip Pecan Pie",
    "categoria": "Dessert",
    "area": "American",
    "ingredientes": [
      "300g Plain Flour",
      "75g Butter",
      "100g Cream Cheese",
      "1 tbls Icing Sugar",
      "150g Butter",
      "200ml Maple Syrup",
      "250g Light Brown Soft Sugar",
      "100g Dark Brown Soft Sugar",
      "4 Eggs",
      "1 tsp Vanilla Extract",
      "400g Pecan Nuts",
      "200g Dark Chocolate Chips"
    ],
    "instrucciones": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
    "imagen": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg"
  },
  {
    "id": "53160",
    "nombre": "Pisto con huevos",
    "categoria": "Vegetarian",
    "area": "Spanish",
    "ingredientes": [
      "2 tblsp Olive Oil",
      "2 Onion",
      "4 Chopped Garlic Clove",
      "5 Mixed peppers",
      "1 teaspoon Oregano",
      "Sprigs of fresh Thyme",
      "4 leaves Bay Leaves",
      "2 chopped Courgettes",
      "1 chopped Aubergine",
      "4 large Tomato",
      "4 large Egg",
      "Handful Parsley"
    ],
    "instrucciones": "step 1\r\nHeat the oil in a large flameproof casserole dish or a cast-iron skillet over a low heat. Add the onions and a sprinkle of salt, cover and cook gently for 15 mins, stirring occasionally. Add the garlic and cook for another 2 mins.\r\n\r\nstep 2\r\nNext, throw in the peppers and cook over a medium heat, covered, for about 5 mins, stirring every so often, until the peppers are just tender.\r\n\r\nstep 3\r\nMix in the oregano, thyme, bay leaves, some black pepper and a little salt, if needed. Tip in the courgettes and aubergine, combine thoroughly, and cook over a medium heat, covered, for 10 mins. Stir in the tomatoes, cover and cook for 20 mins, stirring occasionally.\r\n\r\nstep 4\r\nCarefully crack the eggs over the pisto – try not to break the yolks. Cook in the sauce on a medium heat for 5-6 mins until the eggs are cooked through but still a little soft, then scatter with parsley before serving",
    "imagen": "https://www.themealdb.com/images/media/meals/0nswfe1763279040.jpg"
  },
  {
    "id": "52776",
    "nombre": "Chocolate Gateau",
    "categoria": "Dessert",
    "area": "French",
    "ingredientes": [
      "250g Plain chocolate",
      "175g Butter",
      "2 tablespoons Milk",
      "5 Eggs",
      "175g Granulated Sugar",
      "125g Flour"
    ],
    "instrucciones": "Preheat the oven to 180°C/350°F/Gas Mark 4. Grease and line the base of an 8 in round spring form cake tin with baking parchment\r\nBreak the chocolate into a heatproof bowl and place over a saucepan of gently simmering water and stir until it melts. (or melt in the microwave for 2-3 mins stirring occasionally)\r\nPlace the butter and sugar in a mixing bowl and cream together with a wooden spoon until light and fluffy. Gradually beat in the eggs, adding a little flour if the mixture begins to curdle. Fold in the remaining flour with the cooled, melted chocolate and milk. Mix until smooth.\r\nSpread the mixture into the cake tin and bake for 50-55 mins or until firm in the centre and a skewer comes out cleanly. Cool for 10 minutes, then turn out and cool completely.",
    "imagen": "https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg"
  },
  {
    "id": "52960",
    "nombre": "Salmon Avocado Salad",
    "categoria": "Seafood",
    "area": "British",
    "ingredientes": [
      "400g Salmon",
      "3 Avocado",
      "1 Cucumber",
      "400g Spinach",
      "4 tbs Mint",
      "zest and juice of 1 Lime",
      "2 tsp Honey",
      "3 tbs Olive Oil"
    ],
    "instrucciones": "Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing.\r\n\r\nHeat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm.",
    "imagen": "https://www.themealdb.com/images/media/meals/1549542994.jpg"
  },
  {
    "id": "53232",
    "nombre": "Vietnamese chicken salad",
    "categoria": "Chicken",
    "area": "Vietnamese",
    "ingredientes": [
      "140g Rice Noodles",
      "1 Carrots",
      "1/2 Cucumber",
      "2 Chicken Breasts",
      "50g Radish",
      "1/2 Red Onions",
      "Bunch Mint",
      "25g Peanuts",
      "1 chopped Red Chilli",
      "Zest and juice of 1 Lime",
      "1 ½ tbsp Fish Sauce",
      "1 ½ tbsp Soy Sauce",
      "1 ½ tbsp Sesame Seed Oil"
    ],
    "instrucciones": "step 1\r\nTo make the dressing, whisk all the ingredients together in a large serving bowl. Cook the noodles following pack instructions, then drain and add to the bowl with the dressing.\r\n\r\nstep 2\r\nPeel the carrot into long strips using a vegetable peeler. Do the same for the cucumber, until you reach the seeds (discard them). Add the carrot and cucumber to the noodle mixture along with the shredded chicken, radishes, red onion and mint. Toss well to coat in the dressing, scatter over the peanuts and serve.",
    "imagen": "https://www.themealdb.com/images/media/meals/pk8wtn1763758591.jpg"
  },
  {
    "id": "52864",
    "nombre": "Mushroom & Chestnut Rotolo",
    "categoria": "Vegetarian",
    "area": "British",
    "ingredientes": [
      "30g Mushrooms",
      "240g Chestnuts",
      "3 Challots",
      "3 cloves Garlic",
      "3 sprigs Rosemary",
      "500g Wild Mushrooms",
      "2 tblsp Soy Sauce",
      "125ml White Wine",
      "350g Lasagne Sheets",
      "4 tbsp Breadcrumbs",
      "1/2 handful Sage",
      "to serve Truffle Oil"
    ],
    "instrucciones": "Soak the dried mushrooms in 350ml boiling water and set aside until needed. Blitz ¾ of the chestnuts with 150ml water until creamy. Roughly chop the remaining chestnuts.\r\nHeat 2 tbsp olive oil in a large non-stick frying pan. Fry the shallots with a pinch of salt until softened, then add the garlic, chopped chestnuts and rosemary, and fry for 2 mins more. Add the wild mushrooms, 2 tbsp oil and some seasoning. Cook for 3 mins until they begin to soften. Drain and roughly chop the dried mushrooms (reserve the soaking liquid), then add those too, along with the soy sauce, and fry for 2 mins more.\r\nWhisk the wine, reserved mushroom liquid and chestnut cream together to create a sauce. Season, then add half to the mushroom mixture in the pan and cook for 1 min until the sauce becomes glossy. Remove and discard the rosemary sprigs, then set the mixture aside.\r\nHeat oven to 180C/160C fan/gas 4. Bring a large pan of salted water to the boil and get a large bowl of ice water ready. Drop the lasagne sheets into the boiling water for 2 mins or until pliable and a little cooked, then immediately plunge them into the cold water. Using your fingers, carefully separate the sheets and transfer to a clean tea towel. Spread a good spoonful of the sauce on the bottom two thirds of each sheet, then, rolling away from yourself, roll up the shorter ends. Cut each roll in half, then position the rolls of pasta cut-side up in a pie dish that you are happy to serve from at the table. If you have any mushroom sauce remaining after you’ve rolled up all the sheets, simply push it into some of the exposed rolls of pasta.\r\nPour the rest of the sauce over the top of the pasta, then bake for 10 mins or until the pasta no longer has any resistance when tested with a skewer.\r\nMeanwhile, put the breadcrumbs, the last 2 tbsp olive oil, sage leaves and some seasoning in a bowl, and toss everything together. Scatter the rotolo with the crumbs and sage, then bake for another 10 mins, until the top is golden and the sage leaves are crispy. Leave to cool for 10 mins to allow the pasta to absorb the sauce, then drizzle with a little truffle oil, if you like, before taking your dish to the table.",
    "imagen": "https://www.themealdb.com/images/media/meals/ssyqwr1511451678.jpg"
  },
  {
    "id": "53318",
    "nombre": "Torta de fiambre",
    "categoria": "Pork",
    "area": "Uruguayan",
    "ingredientes": [
      "150g Cheddar Cheese",
      "200g Ham",
      "3 Egg",
      "100g Vegetable Oil",
      "240g Milk",
      "120g All purpose flour",
      "2 tsp Baking Powder",
      "1 tsp Salt",
      "To taste Dried Oregano"
    ],
    "instrucciones": "Line the bottom of a springform of 20-2cm (8-9inches) with parchment paper, I usually leave some overhang as the batter is very liquid and may spill a bit. Preheat oven to 220 degrees Celsius.\r\n\r\n2\r\nGrate the cheese and take out the ham.\r\n\r\n3\r\nMix all remaining ingredients in a large bowl for about one to two minutes.\r\n\r\n4\r\nPour half the batter into the prepared pan, it is going to be very liquid. Then place ham and cheese on top and pour the remaining batter on top.\r\n\r\n5\r\nBake for about 20-25 minutes or until top is golden. Wait for a few minutes before releasing from the pan and enjoy either hot or cold with some fresh herbs.",
    "imagen": "https://www.themealdb.com/images/media/meals/okl9cm1764371087.jpg"
  },
  {
    "id": "53057",
    "nombre": "Traditional Croatian Goulash",
    "categoria": "Beef",
    "area": "Croatian",
    "ingredientes": [
      "500g Beef",
      "2 chopped Onions",
      "2 chopped Carrots",
      "2 cloves Garlic",
      "2 Bay Leaf",
      "200ml Red Wine",
      "2 Litres Water",
      "3 tbs Mustard",
      "1tbsp Salt",
      "1/2 tsp Pepper",
      "1/2 tsp Paprika",
      "2 tbs Vegetable Oil"
    ],
    "instrucciones": "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour\r\nHeat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned. Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot\r\nCut the onions very fine, peel the carrots and shred it using a grater. Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster\r\nOnce the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid\r\nCover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes\r\nAllow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit\r\nSlice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors",
    "imagen": "https://www.themealdb.com/images/media/meals/n1hcou1628770088.jpg"
  },
  {
    "id": "53165",
    "nombre": "Torrijas with sherry",
    "categoria": "Breakfast",
    "area": "Spanish",
    "ingredientes": [
      "2 medium Egg",
      "2 tbsp Double Cream",
      "2 tblsp Milk",
      "3 tsp Golden Caster Sugar",
      "3  tablespoons Sweet Sherry",
      "4 thick slices Bread",
      "For frying Olive Oil",
      "To serve Icing Sugar",
      "To serve Creme Fraiche"
    ],
    "instrucciones": "step 1\r\nIn a wide, shallow bowl, beat the eggs with the cream, milk, golden caster sugar and sherry. Cut each slice of bread in two and dip them into the egg mix, turning to make sure they get a good coating on either side. Soak bread in egg mixture for 10 mins to absorb the liquid (carefully turn them over from time to time and make sure they don’t get too soggy).\r\n\r\nstep 2\r\nHeat 1½ tbsp olive oil in a large frying pan and cook the bread for about 3 mins on each side until dark golden and crisp on the edge. Keep the slices warm in a low oven as you cook the rest.\r\n\r\nstep 3\r\nDivide the torrijas between plates and dust with the icing sugar. Serve with crème fraîche or Greek yogurt on the side.",
    "imagen": "https://www.themealdb.com/images/media/meals/f3ee3y1763309332.jpg"
  },
  {
    "id": "53191",
    "nombre": "Pad Thai",
    "categoria": "Seafood",
    "area": "Thai",
    "ingredientes": [
      "125g Rice Noodles",
      "Juice of 3 Lime",
      "1/2 teaspoon Cayenne Pepper",
      "2 teaspoons Muscovado Sugar",
      "2 tablespoons Fish Sauce",
      "2 tablespoons Vegetable Oil",
      "200g Tiger Prawns",
      "4 finely sliced Spring Onions",
      "140g Bean Sprouts",
      "25g Peanuts",
      "Handful Coriander",
      "2 Lime",
      "To serve sweet chilli sauce"
    ],
    "instrucciones": "step 1\r\nPut the noodles in a large heatproof bowl, pour boiling water over them and leave for 4 minutes, then drain and refresh under cold running water.\r\n\r\nstep 2\r\nPut the lime juice, cayenne, sugar and fish sauce in a bowl and mix well. Have all the other ingredients ready by the cooker.\r\n\r\nstep 3\r\nHeat the oil and fry the prawns until warmed through. Add the spring onions and noodles and toss around. Tip in the lime juice mixture, then stir in the beansprouts and half the peanuts and coriander. Cook for 1 minute until everything is heated through.\r\n\r\nstep 4\r\nPile into a large dish, scatter with the rest of the peanuts and coriander, and serve with lime wedges and sweet chilli sauce.",
    "imagen": "https://www.themealdb.com/images/media/meals/rg9ze01763479093.jpg"
  },
  {
    "id": "52950",
    "nombre": "Szechuan Beef",
    "categoria": "Beef",
    "area": "Chinese",
    "ingredientes": [
      "1/2 lb Beef",
      "1/2 tsp Salt",
      "1 tsp Sesame Seed Oil",
      "1 pinch Pepper",
      "1 Egg White",
      "3 tbs Starch",
      "4 tbs Oil",
      "1 tsp Ginger",
      "1 tsp Garlic",
      "3/4 cup Onion",
      "1/2 cup Carrots",
      "3/4 cup Green Pepper",
      "1 cup Celery",
      "1 cup Mushrooms",
      "1 tbs Cooking wine",
      "1 cup Water",
      "1 tbs Oyster Sauce",
      "1/2 tsp Hotsauce",
      "1 tsp Sugar",
      "1 tbs Soy Sauce"
    ],
    "instrucciones": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.\r\nSTEP 2 - STIR FRY\r\nFirst Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.\r\nSet the beef aside\r\nIn a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.\r\nNext add all of the vegetables and then add sherry cooking wine and 1 cup of water.\r\nTo make the sauce add oyster sauce, hot pepper sauce, and sugar.\r\nadd the cooked beef and 1 spoon of soy sauce\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
    "imagen": "https://www.themealdb.com/images/media/meals/1529443236.jpg"
  },
  {
    "id": "52861",
    "nombre": "Peanut Butter Cheesecake",
    "categoria": "Dessert",
    "area": "American",
    "ingredientes": [
      "50g Butter",
      "175g Peanut Cookies",
      "5 Gelatine Leafs",
      "500g Ricotta",
      "175g Peanut Butter",
      "175g Golden Syrup",
      "150ml Milk",
      "275ml Double Cream",
      "2 tblsp Light Brown Soft Sugar",
      "Crushed Peanut Brittle"
    ],
    "instrucciones": "Oil and line a 20cm round loose- bottomed cake tin with cling film, making it as smooth as possible. Melt the butter in a pan. Crush the biscuits by bashing them in a bag with a rolling pin, then stir them into the butter until very well coated. Press the mixture firmly into the base of the tin and chill.\r\nSoak the gelatine in water while you make the filling. Tip the ricotta into a bowl, then beat in the peanut butter and syrup. Ricotta has a slightly grainy texture so blitz until smooth with a stick blender for a smoother texture if you prefer.\r\nTake the soaked gelatine from the water and squeeze dry. Put it into a pan with the milk and heat very gently until the gelatine dissolves. Beat into the peanut mixture, then tip onto the biscuit base. Chill until set.\r\nTo freeze, leave in the tin and as soon as it is solid, cover the surface with cling film, then wrap the tin with cling film and foil.\r\nTo defrost, thaw in the fridge overnight.\r\nTo serve, carefully remove from the tin. Whisk the cream with the sugar until it holds its shape, then spread on top of the cheesecake and scatter with the peanut brittle.",
    "imagen": "https://www.themealdb.com/images/media/meals/qtuuys1511387068.jpg"
  },
  {
    "id": "53081",
    "nombre": "Potato Salad (Olivier Salad)",
    "categoria": "Vegetarian",
    "area": "Russian",
    "ingredientes": [
      "4 Potatoes",
      "3 Carrots",
      "1 tbs Salt",
      "1/2 tbs White Wine Vinegar",
      "4 Eggs",
      "7 oz Sausages",
      "4 oz Dill",
      "1 can Peas",
      "4 Onions",
      "1 cup Mayonnaise"
    ],
    "instrucciones": "Cut the potatoes and carrots into small uniform cubes.\r\nPlace them in a large pot and fill with water.\r\nAdd salt and vinegar. Bring it to a boil over medium high heat, and then reduce the heat to medium and continue to cook until the potatoes are cooked through, about 15 minutes. Drain the potatoes and let it cool to room temperature.\r\nMeanwhile, cut the sausage and pickles into small cubes, and chop the green onions.\r\nCut the hard-boiled eggs into small cubes as well.\r\nIf using fresh dill, chop them as well.\r\nIn a large bowl, combine potatoes, carrots, sausage, pickles, peas and green onions.\r\nAdd mayo and dill and mix until well combined.\r\nSalt and pepper to taste. Cover with a plastic wrap and refrigerate for at least 1 hour before serving.",
    "imagen": "https://www.themealdb.com/images/media/meals/ebvuir1699013665.jpg"
  },
  {
    "id": "52974",
    "nombre": "Keleya Zaara",
    "categoria": "Lamb",
    "area": "Tunisian",
    "ingredientes": [
      "4 tbs Olive Oil",
      "750g Lamb",
      "1 1/2 tsp Saffron",
      "1 Large Chopped Onion",
      "25 ml Water",
      "30g Parsley",
      "1 tbs Butter",
      "1 Lemon"
    ],
    "instrucciones": "Heat the vegetable oil in a large frying pan over medium-high heat. Add the lamb and cook until browned on all sides, about 5 minutes. Season with saffron, salt and pepper to taste; stir in all but 4 tablespoons of the onion, and pour in the water. Bring to the boil, then cover, reduce heat to medium-low, and simmer until the lamb is tender, about 15 minutes.\r\nUncover the pan, stir in the butter and allow the sauce reduce 5 to 10 minutes to desired consistency. Season to taste with salt and pepper, then pour into a serving dish. Sprinkle with the remaining chopped onions and parsley. Garnish with lemon wedges to serve.\r\n",
    "imagen": "https://www.themealdb.com/images/media/meals/8x09hy1560460923.jpg"
  },
  {
    "id": "53151",
    "nombre": "Paella",
    "categoria": "Seafood",
    "area": "Spanish",
    "ingredientes": [
      "3 tablespoons Olive Oil",
      "10 Raw tiger prawns",
      "Bunch Parsley",
      "100 ml Dry sherry",
      "500g Mussels",
      "Pinch Saffron",
      "150g Chorizo",
      "1 chopped Onion",
      "3 cloves Garlic",
      "1 medium Squid",
      "2 Tomato",
      "250g Paella Rice",
      "100g Broad Beans",
      "1 Lemon Zest"
    ],
    "instrucciones": "step 1\r\nHeat 1 tbsp of the oil in a wide, shallow pan. Add the prawn heads and parsley stalks and sizzle until the heads turn pink, then mash with a potato masher. Pour over the sherry or wine and 300ml water, season with salt and simmer for 10 mins to make a stock, mashing the prawn heads as they cook.\r\n\r\nstep 2\r\nScatter the mussels into the pan, cover the pan loosely with a lid or tea towel, then put over a high heat for 3-4 mins until the mussels just open. Stir to release the mussel juices, then pour the contents of the pan into a colander set over a large bowl containing the saffron. Let the saffron steep in the stock – you will need 700ml in total, so top up with water if needed and give everything a good stir. Pick the mussels out from the colander, then set aside.\r\n\r\nstep 3\r\nWipe out the pan and add the rest of the olive oil. Sizzle the chorizo until it releases its oil, then add the onion and garlic and cook until softened. Add the squid and turn over until it turns white. Add the tomatoes and cook down for a minute, then pour over most of the stock, give everything a good stir and bring to the boil. Scatter the rice over the stock, stir well once, then boil vigorously for 5 mins. Reduce the heat to the lowest setting and slowly simmer for 10 mins without stirring until the rice has absorbed most of the liquid.\r\n\r\nstep 4\r\nTuck the prawn tails into the rice and simmer for 5 mins, turning them over until cooked through. Stir through the mussels and broad beans or peas. Taste the rice – if it is still a little raw but the pan is dry, add a splash more stock and continue to cook; if it’s too soupy, then increase the heat to cook off the last of the stock.\r\n\r\nstep 5\r\nOnce the rice is just cooked, turn off the heat and cover with a tea towel for a few minutes. Scatter over the parsley leaves and lemon zest, then season with smoked salt if you like. Stir everything once, then serve straight from the pan, with lemon wedges on the side.",
    "imagen": "https://www.themealdb.com/images/media/meals/9bl20p1763248192.jpg"
  },
  {
    "id": "53294",
    "nombre": "Zapiekanki",
    "categoria": "Pork",
    "area": "Polish",
    "ingredientes": [
      "2 Baguette",
      "1 tablespoon Butter",
      "2 tsp Vegetable Oil",
      "1 chopped Onion",
      "300g Mushrooms",
      "1 clove Garlic",
      "1 tablespoon Mayonnaise",
      "50g Cheddar Cheese",
      "75g Ham",
      "75g Polish Kabanos",
      "50g Mozzarella",
      "2 Dill",
      "1 tablespoon Chives",
      "Drizzle Tomato Ketchup"
    ],
    "instrucciones": "step 1\r\nHeat the oven to 200C/180C fan/gas 6. Bake the baguettes on a baking tray for 8-10 mins, then leave to cool.\r\n\r\nstep 2\r\nHeat 2 tsp of the butter and 1 tsp of the oil in a pan over a low heat and cook the chopped onion for 5 mins until soft. Stir in the mushrooms, turn the heat to medium and cook for 5-10 mins more until the veg is soft and the mushroom liquid has evaporated. Stir in the garlic and cook for 1-2 mins until soft. Season, then stir in the mayonnaise and remove from the heat.\r\n\r\nstep 3\r\nHalve the baguettes lengthways, then return to the baking tray, cut-side up and spread over the mushroom mixture, then sprinkle over the cheddar, ham, kabanos and mozzarella. Bake for 8-10 mins, or until the cheese has melted and turned golden.\r\n\r\nstep 4\r\nMeanwhile, heat the remaining butter and oil in a pan over a medium heat and fry the sliced onions for 5 mins until golden and soft. Remove from the heat and set aside. Once the pizzas are cooked, top with the caramelised onions, dill pickles (if using), the chives and a zig-zag drizzle of ketchup.",
    "imagen": "https://www.themealdb.com/images/media/meals/72lmpt1764122511.jpg"
  },
  {
    "id": "52779",
    "nombre": "Cream Cheese Tart",
    "categoria": "Starter",
    "area": "American",
    "ingredientes": [
      "250g Flour",
      "125g Butter",
      "1 Egg",
      "Pinch Salt",
      "300g Cheese",
      "100ml milk Milk",
      "3 Eggs",
      "100g Parmesan Cheese",
      "350g Plum tomatoes",
      "3tbsp White Vinegar",
      "1 tbsp Honey",
      "Topping Basil"
    ],
    "instrucciones": "Crust: make a dough from 250g flour (I like mixing different flours like plain and wholegrain spelt flour), 125g butter, 1 egg and a pinch of salt, press it into a tart form and place it in the fridge. Filling: stir 300g cream cheese and 100ml milk until smooth, add in 3 eggs, 100g grated parmesan cheese and season with salt, pepper and nutmeg. Take the crust out of the fridge and prick the bottom with a fork. Pour in the filling and bake at 175 degrees C for about 25 minutes. Cover the tart with some aluminium foil after half the time. In the mean time, slice about 350g mini tomatoes. In a small pan heat 3tbsp olive oil, 3tbsp white vinegar, 1 tbsp honey, salt and pepper and combine well. Pour over the tomato slices and mix well. With a spoon, place the tomato slices on the tart, avoiding too much liquid on it. Decorate with basil leaves and enjoy",
    "imagen": "https://www.themealdb.com/images/media/meals/wurrux1468416624.jpg"
  },
  {
    "id": "53319",
    "nombre": "Chivito sandwich",
    "categoria": "Beef",
    "area": "Uruguayan",
    "ingredientes": [
      "80g Milk",
      "60g Butter",
      "1 tablespoon Molasses",
      "220g Water",
      "9 Egg",
      "500g Bread Flour",
      "10g Salt",
      "10g Yeast",
      "Splash Egg Wash",
      "Sprinkling Sesame Seed",
      "4 Onion",
      "8 Sirloin steak",
      "To serve Garlic",
      "8 Bacon",
      "8 slices Ham",
      "8 slices Mozzarella",
      "4 Tomato",
      "1/4 Lettuce",
      "To serve Mustard",
      "To serve Chimichurri sauce"
    ],
    "instrucciones": "For the brioche buns heat the milk with the butter and molasses until the butter has melted. Add the cold water and egg to this mix.\r\n\r\n2\r\nIn a large bowl place flour, salt and yeast and mix. Then add the milk and water mix and stir with a wooden spoon until combined. You don't have to knead the dough, it is perfectly fine to do this by hand with a wooden spoon, this doesn't need to be very thorough. Cover with a damp towel and stick in the fridge overnight.\r\n\r\n3\r\nThe next morning knead dough on a generously floured surface for a little and cut into eight equal pieces. Shape these into balls and place on a baking sheet lined with parchment paper. Cover again with damp towel and let rise for about an hour or until double in size.\r\n\r\n4\r\nHeat oven to 220 degrees Celsius. Brush the buns with either milk, heavy cream or egg wash and sprinkle with sesame seeds, if desired. Bake for about 15-20min or until golden. Let cool.\r\n\r\n5\r\nFor the toppings chop the onions and sauté in a bit of butter, let caramelize, this may take ten to 15 minutes, stir occasionally. Rub the steaks with a bit of garlic and then grill or fry the steaks, the bacon, and eggs with salt and pepper, toast the buns after having cut in half. Spread mustard on one bun half, layer each chivito with steak, a slice of ham, a slice of cheese, one bacon stripe, a tomato slice, and some lettuce. Place fried egg on top and sprinkle generously with chimichurri and some onions right before serving.",
    "imagen": "https://www.themealdb.com/images/media/meals/j80gmw1764372176.jpg"
  }
]